#13: Konversi nilai numerik ke dalam sejumlah kategori

In [14]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0     6
1    87
2    89
3    81
4    38
5    88
6    45
7    20
8    65
9    85

In [4]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0     6          anak
1    87        manula
2    89        manula
3    81        manula
4    38        dewasa
5    88        manula
6    45        dewasa
7    20        dewasa
8    65        dewasa
9    85        manula

#14: Menggabungkan (merge) dua Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   2   4  10   8   3
1   6   9   9   9  12
2  13   2   6  18   7
3  12  11  10  16   3
4   9   5   1  14   7

In [7]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D  E
0   2   4  10   8  3
2  13   2   6  18  7
3  12  11  10  16  3

In [8]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A  B  C   D   E
1   6  9  9   9  12
2  13  2  6  18   7
4   9  5  1  14   7

In [9]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B  C   D  E
0  13  2  6  18  7

In [10]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   2   4  10   8   3
1   6   9   9   9  12
2   9   5   1  14   7
3  12  11  10  16   3
4  13   2   6  18   7


#15: Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

In [12]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [13]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [14]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur


#16: Menata ulang Data Frame dengan mutiple indexes menggunakan unstack()

In [15]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0.0,0.0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1.0,2.0,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1.0,2.0,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1.0,2.0,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1.0,2.0,113781,151.5500,C22 C26,S